app/controllers/school_classes_controller.rb

  def create
    @class = SchoolClass.create(class_params(:title, :room_number))
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Fan"], ["room_number", 50], ["created_at", "2018-08-15 13:28:14.909642"], ["updated_at", "2018-08-15 13:28:14.909642"]]

  def update
    @class = SchoolClass.find(params[:id])
    @class.update(class_params(:title, :room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-08-15 16:28:04.238846"], ["id", 1]]